// Version 2021-10-19
//

//var Uti = require("../Uti.Module").Uti
const fs = require('fs');
var path = require('path');
const net = require('net');

var Uti = {
    proc_argv2obj: function () {
        var argv = process.argv.slice(2);
        var obj = {};
        argv.forEach(function (str) {
            var pos = str.indexOf(":");
            if (pos > 0) {
                var key = str.substr(0, pos);
                var val = str.substr(1 + pos);
                obj[key] = val;
            }
            else {
                console.log("err:" + str);
            }
        });
        return { obj: obj, argv: argv };
    }
}

var DirFileUti = {
    getDirectories: function (srcpath) {
        return fs.readdirSync(srcpath).filter(function (file) {
            if ("." === file[0]) return false;
            return fs.statSync(path.join(srcpath, file)).isDirectory();
        });
    },
    getPathfiles: function (srcpath) {
        return fs.readdirSync(srcpath).filter(function (file) {
            if ("." === file[0]) return false;
            return fs.statSync(srcpath + '/' + file).isFile();
        });
    },

    genJs: function (srcPath, output) {
        var fary = this.getPathfiles(srcPath);
        var dary = this.getDirectories(srcPath);

        output[srcPath] = []
        for (var k = 0; k < fary.length; k++) {
            var sfl = fary[k];
            var pathfile = path.join(srcPath, sfl);
            var stats = fs.statSync(pathfile);
            var ob = {}
            ob[sfl] = stats.size
            output[srcPath].push(ob);// += stats.size;
        }
        for (var i = 0; i < dary.length; i++) {
            var spath = dary[i];
            this.genJs(path.join(srcPath, spath), output);
        }
    },
    genJs_writefile: function () {
        var output = {}
        this.genJs("./", output)
        var str = "var idxobj = " + JSON.stringify(output, null, 4)
        //console.log(output)
        fs.writeFileSync("idxobj.json.js", str, "utf8")
    }
}



function watch_dir(cbf) {
    var myArgs = process.argv.slice(2);
    var IgnoreFiles = [".", "index.html", "index.htm", "idxobj.json.js"]
    if (myArgs.length === 1) {
        var watchDir = myArgs[0]
        fs.watch(watchDir, { recursive: true }, function (eventType, filename) {
            console.log(`\n-event type: ${eventType}\n-filename: ${filename}`);
            if (filename && IgnoreFiles.indexOf(filename) < 0) {
                //console.log(`-filename provided: ${filename}`);
                setTimeout(function () {
                    if (cbf) cbf();
                }, 1000)
                if (eventType === 'remane') {
                }
            } else {
                console.log(`-filename not provided.`);
            }

        })
        return watchDir
    }
}





var chn_charCode_jinwen =
{
    "丕纰砒邳铍皮疲啤脾丙疐疋合亥未中匜丰倗琮玉旡于弟丝幽侜丸纨芄烷晚碗挽婉惋畹义娥咸成栽戎戋戈律徉乒娉俜平评瓶凭萍坪枰乔侨瞧翘憔樵谯荞巧亢夸骑熯艰汏立夫俔兄什神甚审婶谂哂渖矧慎仓冥以孕介妣盆汊阳娵娠姜伉钪考烤拷栲靠铐犒科伏朊伊尾竟羡休任众化优忧悠呦麀游油邮柚鱿伟玮伪炜纬娓苇猥痿韪伢岈琊蚜讶迓揠氩砑伫箸炷蛀杼翥疰抓转砖体踢梯剔锑提题啼蹄醍佚牒蹀堞瓞揲垤鲽盯钉你拟旎尿腻昵溺睨慝佣臃邕镛墉慵痈壅饔佩沛辔帔旆": "\u0000",
    "霈喷湓烹抨侧厕恻岑涔噌层蹭差插便变遍辩辨辫卞俨偃魇鼹兖郾琰罨厣蝘俭碱茧柬蹇謇硷睑倜逖裼添填甜恬阗腆舔倦眷隽绢狷鄄撅噘绝偎薇逶煨葳隈维围违惟偻娄髅蝼蒌耧篓嵝陋漏僬鹪蛟艽茭嚼矫峤脚搅僭涧饯毽楗腱牮将江允身旨企千尸匕人阿啊公责棘且祖屯力朋吝教兰蓝栏拦篮澜岚斓阑褴具剧巨聚拒距惧瞿炬飓冬卒心买宝翌羽米鼍澫冰饼屏柄炳禀邴病摒波决掘诀崛抉倔獗厥蹶攫冼现线限县宪馅腺岘香凉粮粱踉椋两魉亮辆凌玲铃陵伶聆囹菱苓翎刮栝胍": "\u0000",
    "鸹寡挂褂卦诖乖到道悼稻焘纛德的灯剁惰驮柁婀屙额俄哦剑键荐鉴践舰箭贱槛谏功攻恭躬蚣觥巩拱汞珙劲浸靳缙烬噤觐荩赆妗勋醺薰埙曛窨獯询巡循勤芹擒覃禽噙溱檎锓北臾及儿兑耋夌长尻亟匹痞癖圮擗庀仳屁僻譬医椅漪咿揖噫猗壹铱黟印吹欠既即兵异因夹亦厝锉答搭嗒耷褡哒打达原园源圆缘援猿垣辕沅叮町酊疔仃耵玎顶定订叵区岩胄冑会唐古由吉叶液曳拽烨腋谒邺靥晔司卜龋卑畋甫邦稠田祊同凡棋基其嬉豊彭熹喜吼候逅堠鲎呼忽糊惚呆癌皑矮蔼霭嗳": "\u0000",
    "爱呵腌锕嗄哀挨埃唉哎咂匝拶杂咱砸咋哉甾载和核盒荷阂涸阖曷劾菏咎往洗后後正沚之步止咐驸赙馥蝮鲋鳆咖嘎伽品言洱圣联童见湄面妊哇娲蛙洼娃瓦佤袜腽歪哞谋眸鍪蛑侔某姆亩哥割胳搁疙咯鸽屹仡圪哭枯窟骷刳堀苦库裤酷喾垮侉跨挎胯蒯快块筷脍哙侩狯郐宽髋款框商卢雨韦保毓寅丁宜危啮镊镍陧颞蘖您凝拧咛喁勇涌踊泳咏俑恿甬蛹喙恚浍哕缋蕙蟪婚荤阍嗌嗐酣憨顸鼾蚶含寒汗韩嗟秸疖喈杰捷截洁劫竭嗤蚩笞鸱媸螭眵魑持迟嗨还孩骸海胲醢害骇氦嗾": "\u0000",
    "瞍嗽苏稣酥俗诉速素嘘虱蓍时实识拾蚀埘噬弑弒谥贳铈螫舐筮殖嚆号毫豪嚎壕貉嗥濠蚝四三二卯癸才刞多乇劦囿坨鸵佗酡椭庹唾柝箨挖垃邋旯砬辣腊蜡剌瘌莱垌峒胴都兜抖陡蚪逗窦痘嘟读独顿毒渎垲锴忾看刊堪勘龛戡侃垸瑗越阅跃悦粤刖瀹樾塾秫数属署鼠薯暑蜀曙境静敬镜净径靖痉迳胫大光攸斗非兀比何微元奂擐豢漶逭鲩荒慌肓皇套特忑忒铽腾疼藤誊滕妃绯蜚鲱肥腓淝匪诽斐妪峪芋昱煜熨燠蓣饫阈妮尼泥倪霓坭猊怩铌鲵姈奴娅囡嫀嬂娘汝侄奻娌澧锂醴": "\u0000",
    "鳢历例励厉莉娕姬姃如婐妥每凶尧叩婿酗煦洫溆勖蓿喧轩萱媲淠甓睥片篇偏翩蹁嫒嫖瞟殍票嘌撇瞥氕苤嫠蠡鲡蓠里理礼鲤俚逦子朿酉戌执戊莫庚辰占安宁蒿亳黾万龙雇脽鹿客刻课恪溘骒缂氪锞肯恳啃垦裉坑铿空倥崆箜恐孔控抠芤扣寇蔻筘宫向亭槁高涂余今依初宿京袁龟虫它鸡雉萑鸟寮燎嘹獠鹩蓼钌料廖镣尚烧稍捎蛸筲艄韶就救疚舅臼鹫僦厩柩山霖霋霝咰明昌昃昼昔岭另呤溜留流刘瘤榴岱迨骀绐埭担耽眈殚峰疯锋蜂枫烽酆葑沣崇宠铳抽瘳愁仇筹酬绸崎琦": "\u0000",
    "淇岐俟耆颀圻骐崔榱璀脆粹萃翠瘁悴淬崦恹严研延沿颜阎盐蜒嵫紫梓姊籽滓秭笫耔字嶂幛着招昭钊啁找沼照嶝低滴堤嘀氐镝羝敌迪巅点碘踮电店甸淀垫工网鬯豆盥盂尽血勿射巳咙风橐洹灾丘龠祝奭市士式视势试释适氏饰帆藩幡蕃烦繁泛樊燔矾帛白设争尤爰酎爪肘术带肉糸系受方遘单典史帷帏圩囗潍桅嵬闱沩涠幅符浮扶袱俘芙匐辐涪庇璧泌陛弼篦婢愎痹铋府腐抚辅俯脯釜腑拊滏庞龚鲁唯鸣雀集雥凫淮庠想响享飨饷鲞像项橡庵廷霆蜓葶莛挺艇梃通开揩慨凯": "\u0000",
    "铠楷恺剀弁缏标彪勺镖膘骠镳杓弗册狅巫亚庸必汫井丹弪婧獍靓扃窘炯迥究纠彀姑骨孤估辜咕呱箍沽彤铜桐瞳佟酮仝茼潼彶彷行宣砓厚砅硪庶宕彿否肤敷孵稃麸趺跗很狠恨哼亨横衡恒蘅桁徕涞崃铼赖睐癞籁赉濑徙玺屣葸蓰铣细戏隙饩忤鹉牾迕庑怃仵摀务误怄趴啪葩爬杷怕帕琶怍胙阼唑祚思斯私撕厮嘶鸶澌缌怿悒肄佾殪挹埸劓镱瘗恼瑙闹淖讷馁嫩恁能悃阃括阔扩廓蛞拉啦喇悟雾坞晤鹜痦寤骛芴杌惘罔辋魍旺妄委威巍萎惬锲挈箧亲钦侵衾琴惹热仁鵀忍稔荏": "\u0000",
    "认韧纫愆阡仟岍扦佥搴褰前愣哩离丽黎璃漓狸梨篱慢漫曼墁幔缦熳镘忙茫憾翰撼旱捍悍瀚焊颔菡戬谫囝笕翦趼件建健扑仆噗葡蒲菩匍璞濮莆扮瓣拌绊帮梆膀榜绑抛泡脬跑袍咆匏庖麃报暴抱爆鲍曝刨瀑趵菢抹蚂嬷吗蟆痲码玛骂抻陈沉晨橙忱谌宸蔯碜抿闵愍铭茗溟瞑暝螟拆钗柴豺侪虿瘥搀觇缠拇幕慕墓募暮睦沐坶苜拍排牌徘俳派湃蒎攀挞闼台胎苔抬邰薹炱跆挪傩诺懦糯喏搦噢喔振赈鸩挣症睁徵蒸怔筝捂毋梧芜浯蜈鼯伍侮妩捌拔跋茇菝魃把靶钯爸捕哺部布怖": "\u0000",
    "簿埔埠瓿捭拜呗稗班搬斑颁扳瘢据居俱拘驹鞠锯趄掬疽捱掖爷邪揶也野冶业夜推颓腿退褪吞暾饨掴拐怪关观冠棺莞倌纶揆跬愧溃馈匮喟聩篑握渥沃斡幄龌於屋揪鸠赳啾阄久韭灸玖搏膊舶铂箔渤钹鹁踣搽槎刹诧岔姹搿膈镉塥个哿舸铬硌虼摭絷跖埴纸趾咫芷枳轵撖航吭杭绗珩颃巷沆薅播拨玻饽菠钵博伯勃脖撺汆攒窜篡爨衰催摧擅膳讪汕赡缮嬗骟剡鄯操糙槽嘈漕螬艚草策测擦嚓礤猜财材裁彩踩睬攮曩孬挠呶铙蛲脑收熟手守艏授售瘦寿兽故顾固锢梏牿崮痼瓜": "\u0000",
    "敉芈密觅蜜谧汨幂嘧敖嚣嗷鏖鳌翱獒聱螯廒斛醐猢槲鹕觳浒唬早澡枣蚤藻造躁噪皂旮噶轧钆尕尬该赅垓昜晕日祀祥祉柰下上百昧媚寐袂闷扪钔懑焖们昶惝唱畅倡怅超抄吵钞晒衫删煽扇珊栅跚姗潸晷簋贵桂跪柜刽炔刿桧暄谖揎儇悬玄漩璇暧暨霁稷偈鲫髻觊荠跽哜曾朝瀼漅沈川水帝畜页舂期妻欺漆栖沏蹊嘁萋槭札闸铡眨砟诈榨柞咤痄朮对君尹祭左又复癹端杆尴乾竿坩柑泔矸疳杜林杉杋李櫅杲旽楚杏杞析艿夆沎酒坠降阜岳来穆季龢禾椎森朱丧桑杵褚楮触矗怵": "\u0000",
    "搐绌黜亍极急籍嫉藉脊汲岌笈瘠枕疹缜畛轸稹阵镇震圳枢蔬倏菽摅姝纾毹孰赎枨塍铖裎酲逞骋吃痴哧柒欹桤奇旗歧琪脐祺祁柔揉蹂糅鞣儒茹嚅濡孺栊砻癃拢垄陇搂楼喽树述竖恕墅漱俞澍沭桉桨耩强酱匠绛糨焦骄梌柳杕困木生屮濯沓泊棂瓴绫酃泠羚蛉柃鲮领棉眠绵缅勉腼冕娩渑湎棒傍磅谤镑蚌蒡包胞剥棠搪溏螳瑭樘螗饧醣躺棼鼢粉份奋愤粪忿偾瀵榫隼梭嗦唆娑桫嗍蓑槌棰春椿纯唇醇淳鹑槟傧玢豳镔鬓殡摈膑髌橘举矩咀沮踽龃榉莒句檐妍筵芫闫眼演掩衍奄": "\u0000",
    "檩廪躏赁蔺膦拎灵零龄次赐从匆聪葱囱苁骢欢獾环寰鬟桓圜郇缳锾欧殴鸥讴瓯沤偶呕藕耦此涉克舌望羊姓姀饮陷歹傣代戴袋贷殆黛怠玳死南用兴刚箕食献员鼎殂促簇醋猝蹴蹙蔟酢蹿殃鞅洋杨扬疡佯烊炀蛘殉巽汛蕈压雅呀押鸦哑殿惦佃玷簟坫靛钿癜阽毕币秘避壁弊碧拂毙蔽毳啐村皴存蹲忖寸搓撮民直目孙弃孚乘婤妦妞氟桴蜉苻茯莩菔怫艴氤堙洇铟银吟淫垠鄞霪氨池驰匙弛踟墀茌篪坻尺汤趟铴镗羰堂糖膛塘汩鹄牯臌诂瞽罟钴嘏鹘沔眄喵描苗瞄秒渺藐沾瞻詹": "\u0000",
    "毡谵旃鹯展斩辗泖昴冒贸帽貌茂耄瑁懋泗姒耜笥松忪淞崧嵩泵逼荸笔彼鄙俾秕泷渔鲧鱼燕曣雚旧只雈洌捩埒躐鬣临邻琳淋麟洛州沝陆陟燮炎焱炘熿洧诿艉鲔位味卫谓慰魏活伙夥钬或获货祸惑洽髂签牵迁谦铅骞悭芊浃痂笳葭镓袈跏颊戛荚浅遣谴缱歉纤嵌倩堑浙蔗鹧柘真针珍斟侦甄浠僖穸蜥螅菥矽粞硒涑蔌觫酸狻算蒜虽荽睢涝肋勒仂叻泐鳓了擂涨仉丈帐障账胀仗杖瘴涵函焓邯邗喊罕阚汉涷洒汒沁潾洎河潢冲沙淄髭赀孳粢趑觜訾缁鲻淆崤晓筱笑孝啸些歇楔淌": "\u0000",
    "傥帑烫涛掏滔韬饕绦淡蛋诞惮啖澹氮萏当裆混魂浑馄诨溷豁攉渍恣眦踪综棕鬃总偬渗肾蜃胂椹胜牲甥笙绳港岗戆糕皋羔睾篙槔溅煎歼缄笺菅蒹搛湔缣滥啷狼郎廊琅螂榔锒稂滹胡湖葫弧蝴囫灼酌浊茁啄斫镯诼禚擢灿掺璨孱粲苍沧舱伧藏炅鳜滚衮绲辊棍过锅炝悄敲锹跷橇缲硗劁桥烟咽焉淹阉嫣胭湮鄢菸焐阢婺鋈息希吸惜稀悉煌惶徨璜簧凰蝗蟥遑隍熬爵矢我戚王戠毌雍晶泉父刍叉武腹逐先征各出爻乍升吊幼栎泺乐兹率版板阪坂钣舨办半伴牍犊黩髑椟讟肚睹堵": "\u0000",
    "赌笃度渡妒镀芏蠹短断段牖铕右诱佑鼬宥侑蚴釉牺熙溪嘻锡晰樨熄膝郗犀曦羲唏淅皙汐烯翕蟋犁厘罹藜骊蜊黧缡喱鹂犍鹣鲣鞯简减检剪捡拣狁运韵蕴酝愠郓韫恽扎狃忸农浓侬哝脓弄耨孥狒镄芾纷氛芬吩酚坟汾狩绶输殊舒叔疏抒淑梳狺夤龈隐瘾蚓胤应猛懵蠓蜢锰艋孟眯咪猪株蛛洙诛铢茱邾潴槠獬薪馨鑫芯昕忻歆锌信球囚酋虬俅遒赇泅逑犰琥护互沪祜扈戽笏岵怙瑷璁枞丛淙凑楱辏腠粗徂璎撄嘤营迎赢盈蝇莹荧璩氍朐磲鸲蕖蠼蘧娶去瓒錾赃臧驵脏奘遭糟凿瓠": "\u0000",
    "冱华花哗砉划滑猾甗尊奠铸蛊益黄效折不甲亡少小易乞廿十而谷畀孽戒伐鬼畈芳妨坊邡枋钫房防肪畔襻袢泮乓滂螃逄耪炮畦亓萁蕲蛴蜞綦鳍麒起畸跻羁嵇唧畿齑屐剞玑疆浆僵缰茳礓豇讲奖蒋疝鳝伤殇觞熵赏晌疮床幢闯怆炊垂锤捶陲疱呸胚醅陪培赔裴配疴蝌钶窠颏珂髁渴岢痨醪姥佬潦栳铑络烙酪瘩鞑怛笪靼妲疸待呔逮瘪鳖别蹩宾滨彬斌缤濒瘰骆摞珞漯荦雒呒妈麻皈傀圭妫鲑轨诡匦庋宄皎胛挢岬湫钾瘕价架皿扔可乃引弓圉交晋夷盍蚵翮赫贺鹤壑褐黑痕盏崭": "\u0000",
    "搌战站绽湛蘸栈张盲芒氓邙硭蟒漭猫毛矛眚剩嵊晟师诗失施湿狮睇棣娣碲绨嗲颠滇掂癫督旦福兮猱殳秦友宏肱睫桔拮孑桀碣颉讦婕羯瞩拄渚麈住注助著驻柱瞬说朔硕烁铄妁蒴槊搠矣蚁倚旖苡钇舣酏意议砍坎莰瞰康慷糠闶抗炕砗扯彻撤澈掣坼郴琛嗔砚堰赝餍酽谳泱秧鸯砰澎怦匉鹏棚蓬膨篷砺痢郦詈荔枥呖唳猁溧砾轹坜苈疠蛎篥粝硼堋蟛捧碰批披劈坯霹碌鹨隆笼胧聋珑窿茏碍碴喳杈锸查察茶茬楂磋蹉嵯矬痤鹾脞错措挫磬祏石匚曲男周星焛问磺湟篁鳇晃恍谎": "\u0000",
    "幌挥禁津斤筋巾襟矜衿仅紧禅蝉馋潺蟾婵谗廛镡澶租菹足镞组阻诅俎钻躜称趁衬秤谶榇龀撑瞠柽移疑遗仪姨怡颐咦贻稆虑滤氯峦挛孪栾銮滦稿搞缟镐诰郜锆歌格穰攘壤让饶娆桡荛扰绕窳俣育遇狱欲预愈癒域竞并羌老襄巴丑壬乙黹笛涤狄嫡荻籴觌底抵诋笠粒俐隶吏沥雳莅戾俪笨夯坌崩甭蹦迸甏笸破迫魄粕珀剖裒掊铺筐匡诓狂诳夼况矿旷筚箅哔襞跸狴编边鞭砭箦舴仄贼怎谮增憎缯罾箪儋瘅聃郸胆掸赕但弹箱厢湘镶骧葙芗缃详翔簏鹭潞璐辂渌逯氇驴榈簸跛擘": "\u0000",
    "檗啵逋晡钸醭补糈醑续序绪蓄叙恤絮旭累羸镭嫘缧檑蕾垒磊儡纂缵攥嘴最罪醉蕞遵樽纥袼革隔葛阁蛤嗝骼颌纵粽邹诹陬鄹驺鲰走揍纹蚊雯璺阌稳吻紊刎汶绀旰钢纲缸扛杠冈肛罡经精惊睛荆兢鲸泾旌茎绘讳贿晦秽诲彗烩荟卉给根跟哏艮茛耕羹赓继寂忌剂冀妓骥蓟悸伎绰剿焯怊潮嘲巢晁炒耖缇鹈荑替涕剃惕屉嚏悌缈淼杪邈眇妙庙乜咩灭缓换患幻唤宦焕痪涣浣缫扫嫂梢埽瘙色涩瑟缬写谢泄械屑卸懈泻亵缶告曰甘口臭濞鼻臬自罅鲜仙掀暹莶锨氙祆籼罚乏阀筏法": "\u0000",
    "砝珐翻番羞牧牝牡牢牟祈年秝秉羧所索锁琐唢他她踏塌羼娼猖伥阊菖鲳场常尝翡悱篚榧费废沸肺吠痱耤束车梦疾鬲壶永齿贮耻侈褫豉斥翅啻炽敕叱耿颈梗哽鲠埂绠共红供聑闻取耳嚚臣相监苋省肃缩塑溯粟簌嗉谡僳愫肠偿倘裳嫦徜苌厂敞氅肫窀准桌捉卓拙涿倬琢肴珧轺徭繇鳐飖咬杳窈肿踵冢仲洲诌赒轴妯碡背悲杯碑陂埤萆鹎被备胱桄广犷逛规瑰硅闺胼骈谝骗漂飘剽缥螵瓢脂蜘栀卮胝祗职值植踯腧刷唰耍摔甩帅蟀栓拴腰妖吆幺摇遥姚谣瑶窑膻芟埏钐舢苫搧": "\u0000",
    "闪陕善臀托脱拖陀驼砣沱跎至欣肵新薛剐召刜分刃臻箴砧桢蓁榛胗祯浈诊舀药耀钥鹞曜耶噎椰舷鹇痫显险跣猃燹蚬筅船遄椽舡喘舛串钏创窗艅般冉竹妆族追妇东专艘馊嗖溲飕锼擞叟薮艺译亿忆谊抑翼役溢毅艾芩螓寝揿吣青清轻倾卿苕芍绍哨邵潲劭奢赊猞苟岣笱够购构觏垢诟媾苣捐圈娟鹃涓镌蠲卷锩英鹰婴樱膺莺罂鹦缨瑛茅髦锚牦旄蝥蟊茆茜芡慊椠枪抢腔呛锵跄荥硎醒擤性幸悻荇胸匈莓嵋楣镁浼魅莳鲥鼫使始屎是事世莸铀猷疣蚰蝣有黝莠菁粳警景憬阱儆": "\u0000",
    "刭菇鸪毂菰蛄酤觚股贾菜蔡参餐骖残惭蚕惨黪萤萦瀛楹嬴茔滢潆蓥影萼腭垩鹗诶恩摁葬戕干旅斿旋官归曹传蒉愦昆坤鲲锟琨髡捆蒙盟朦萌檬瞢甍礞虻艨蓺夙丮粯承服匿若令邑蔚畏胃喂尉渭猬温瘟蔫拈粘黏鲇鲶碾捻撵酿蕻黉荭讧侯喉猴瘊篌糇蘑馍摹谟嫫默末寞漠墨蘩钒蹯反返饭犯范贩梵虎兕彘豭豕麦果枚采者虚吁墟胥盱顼徐许栩诩虢裹猓椁蜾哈铪虾嘿咳蛇佘舍社摄赦慑麝滠蛏橕城程诚盛惩澄丞埕蛐祛蛆麴诎渠衢劬蜴翳音阴姻殷茵荫喑蝎协鞋携斜胁谐偕撷": "\u0000",
    "勰蝤巯鼽糗屈趋驱躯觑岖蟓消销潇肖萧宵削逍硝蟹邂榭瀣薤躞廨绁渫榍蠕薷铷襦褥缛洳溽蓐蠢戳踔辍龊刺疵呲跐衅囟腥惺猩形型刑邢陉袅嬲茑捏涅聂蹑嗫袤瞀麽没梅媒煤霉玫糜裔逸轶弈疫绎奕熠诣弋裘衣入惄念败贪得贝解裙然燃髯蚺染苒嚷瓤禳裟铩傻啥厦霎歃唼筛酾裢濂奁蠊鲢脸敛琏蔹裨髀庳毖滗蓖芘嬖荜薜褒苞孢煲龅薄堡葆褓鸨褙臂奔贲锛本苯畚西首敝寻眉眢妹午乡美角翊习栗卣乎秋汜虹椸誉寓豫粥喻裕浴御驭谕讯婪好敏妾母女免沫乳词辞慈磁瓷茨": "\u0000",
    "雌祠茈鹚诔耒类泪酹棱楞冷诘楫蒺殛佶戢蕺济纪请顷謦罄箐穷琼穹茕谅晾撩撂聊疗辽僚寥缭谙鞍谨锦瑾馑廑堇槿进近谲矍孓橛噱桷劂爝豹庆廌为象豚莽恙牛奏贞六申辛己文奚洀帚壴贡沟勾钩篝佝枸缑狗贬扁匾碥窆褊贽痣豸忮膣鸷骘蛭踬郅赍犄墼芨丌咭笄乩辑级赤火霾雹旬云名月夕昏赵罩兆肇诏棹笊遮蜇哲趣阒悛全权拳诠颧蜷荃路录露绿禄辘赂漉戮跹杴闲贤嫌弦娴衔涎踌惆畴帱俦雠瞅樗除厨踱铎朵躲垛缍舵堕跺蹬簦等戥邓凳瞪磴镫躇橱雏锄蜍滁蹰处储础": "\u0000",
    "躔产铲阐谄冁蒇骣颤忏轮伦沦仑囵落罗逻萝螺软阮蕤蕊瑞锐芮睿枘蚋轰哄烘薨訇洪鸿弘泓闳辇盗舳朕舟旁冓乂书聿辈倍蓓惫悖焙邶钡孛碚辉灰恢徽诙晖麾珲虺辖遐匣黠瑕狎硖柙夏吓辟剢刀戉蔑斧岁戍远声辱扉物凄洚侚徇址顺一迂淤纡瘀与予愚舆娱愉迄砌憩汔讫葺碛掐恰迷弥谜靡醚猕祢縻蘼弭迹绩饥缉圾矶肌讥叽稽逃陶桃淘萄啕咷洮鼗讨逆夭舞央天须九八七五逝誓嗜侍峙仕恃柿轼拭逢缝冯讽唪奉凤俸佛遏噩呃厄鄂轭颚鳄谔锷遨袄拗媪奥澳傲懊坳骜邃穗燧": "\u0000",
    "谇繸荪狲飧损笋邛蛩筇跫銎邱蚯鳅楸求邸砥柢地第递蒂缔谛郊胶椒娇浇姣跤蕉礁鲛郏恝铗袷蛱假缴绞佼侥郛绂绋祓砩黻罘蚨蝠洑郝浩耗皓昊灏颢喝诃郡骏竣捃浚喀卡郭涡聒蝈崞埚呙国帼馘郯坦毯忐袒钽探叹炭碳酐感敢赶橄秆澉赣淦酩命谬缪摸模磨摩魔膜酯制治志致质智置秩滞酵醮接结节街阶皆揭醯欷鼷席袭媳檄隰觋禧钭透突秃凸图途徒屠荼钱潜虔钳掮黔荨钤箝鬈钺氲匀芸耘纭昀郧陨殒钼嗯唔那拿哪呢纳铁餮听厅汀烃停庭婷铛珰党挡谠荡档菪砀铤锭碇啶": "\u0000",
    "丢铥咚氡铨痊醛辁筌绻畎劝券缺铫爹跌叠迭碟谍蝶喋铮峥狰钲整政证郑诤帧铯穑僧杀纱莎煞砂鲨痧锣箩骡猡椤脶镙裸蠃锶蛳似寺肆伺饲嗣驷锻缎椴簖堆队碓憝怼镂瘘噜撸炉庐芦颅泸轳镟靴学穴踅泶雪鳕谑熏镤普朴谱浦溥圃氆镨蹼镦吨敦墩礅橔盹趸盾钝炖遁沌囤咄哆掇裰夺镧谰懒览揽榄缆漤烂门宰富宓宋家啬竽膏齐闩涮双霜孀爽税睡吮舜闭启户更内塞宛宅室宗闾履屡侣缕吕捋铝褛膂阋禊舄瞎呷峡侠狭霞暇阙瘸却确榷鹊阕悫逡群陌蓦茉秣镆殁瘼貊貘陔改概": "\u0000",
    "盖丐钙芥溉戤肝隘隳回蛔茴洄毁悔汇惠慧雩语宇禹圄屿龉伛庾瘐霄哮枭骁箫枵哓绡魈鸮霍藿镬蠖几机击激积霸颖颍瘿郢硬映媵哟唷拥颗柯棵苛磕坷嗑瞌轲稞颛赚撰篆啭馔装庄桩状颟蛮馒瞒蔓谩鳗鞔满飑飙瘭髟表裱婊鳔憋飒腮鳃赛毵散伞餂忝殄掭挑佻祧条迢鲦饪仞葚轫衽仍容荣融蓉饬傺彳瘛充憧忡艟茺重饺狡徼铰觉校叫较轿窖馀逾渝萸瑜隅揄榆虞禺驶驳鎷马狐豖狈犹尨犬驽努弩怒钕恧衄暖疟骅铧话画桦怀徊槐踝坏验厌宴雁焰艳谚彦晏唁髫龆蜩笤窕跳眺粜": "\u0000",
    "贴帖髹朽秀袖绣嗅岫溴需鬻钰鹆鹬蜮冤渊鸳鸢魁睽逵葵奎馗夔隗暌鲂访仿纺舫放飞啡菲霏鲐太态泰汰钛摊滩鲒姐界借届诫疥蚧骱金鲚芰加佳嘉茄挟枷珈迦鳏管馆惯贯罐灌掼涫鹳鳞磷嶙辚粼遴瞵凛懔鳟鐏撙作昨稓佐做坐座鸫懂董硐动洞冻栋恫侗鸭丫垭桠牙涯崖芽衙睚鸸鲕尔迩饵珥铒贰佴发鸾娈脔卵乱掠略锊抡论鹅峨蛾讹莪锇恶饿扼愕鹌黍利郁封呈焚土雷良示黼负副付附赴覆赋傅缚鼐难楠喃腩蝻赧囊囔鼓饱登灂蒚鬳酓拯盉寍": "\u0000"
}


function export_jinwen(targetdir) {
    Object.keys(chn_charCode_jinwen).forEach(function (chars, lidx) {
        var sidx = lidx.toString().padStart(2, "0")
        var dir = `${targetdir}${sidx}_files`
        var fnames = DirFileUti.getPathfiles(dir).filter(fn => path.extname(fn) === ".png").sort(function (f1, f2) {
            return parseInt(f1.slice(0, -4)) - parseInt(f2.slice(0, -4))
        })
        console.log(lidx, dir, chars)
        console.log(fnames, chars)
        fnames.forEach(function (fn, fidx) {


            var srcfile = `${dir}/${fn}`
            var desfile = `./qq_jinwen2/${chars[fidx]}.png`
            //console.log(idx, cod, fn, srcfile, desfile)
            if (srcfile.indexOf("NaN") >= 0) console.log("s", srcfile)
            if (desfile.indexOf("NaN") >= 0) {
                console.log("d", desfile)
                console.log(cod, chars, idx)
                console.log(fn)
                console.log(dirname)
            }

            fs.copyFileSync(srcfile, desfile)
        })
    })
    var str = JSON.stringify(Object.keys(chn_charCode_jinwen), null, 4)
    fs.writeFileSync("chn_qq_list.json.js", "var chn_qq_list =\n" + str, "utf8")
}
function export_jinwen_by_file(targetdir) {
    Object.keys(chn_charCode_jinwen).forEach(function (chars, lidx) {
        var sidx = lidx.toString().padStart(2, "0")
        var dir = `${targetdir}${sidx}_files`
        var htf = `${targetdir}${sidx}.html`
        var contxt = fs.readFileSync(htf, "utf8")
        console.log(contxt)
        //<img src="./00_files/1127424.png">
        var mat = contxt.match(/img[\s]src[\=][\"][\.][\/]\d\d\_files[\/]\d+[\.]png[\"]/g)
        var mat = contxt.match(/\d+[\.]png/g)
        console.log(mat)

        var fnames = mat
        console.log(lidx, dir, chars)
        console.log(fnames, chars)
        fnames.forEach(function (fn, fidx) {
            var srcfile = `${dir}/${fn}`
            var desfile = `./qq_jinwen2/${chars[fidx]}.png`
            //console.log(idx, cod, fn, srcfile, desfile)
            if (srcfile.indexOf("NaN") >= 0) console.log("s", srcfile)
            if (desfile.indexOf("NaN") >= 0) {
                console.log("d", desfile)
                console.log(cod, chars, idx)
                console.log(fn)
                console.log(dirname)
            }

            fs.copyFileSync(srcfile, desfile)
        })
    })
    var str = JSON.stringify(Object.keys(chn_charCode_jinwen), null, 4)
    fs.writeFileSync("chn_qq_list.json.js", "var chn_qq_list =\n" + str, "utf8")
}
export_jinwen_by_file("../../../../jinwen_tmp2/")
